src/DataProcessors/МодульОбменаЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МодульОбменаЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМарокЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМарки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/DataProcessors/МодульОбменаЕГАИС/Forms/ФормаПоискМарокЕГАИС/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьСписокКодовТиповФСМ_АМ(СписокВыбора)
	
	СписокВыбора.Очистить();
	МакетСхемы = Обработки.МодульОбменаЕГАИС.ПолучитьМакет("EGCommonEnum");
	ТекстСхемы = МакетСхемы.ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСхемы);
	НачалоЗаполнения = Ложь;
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если НачалоЗаполнения И ЧтениеXML.Имя = "xs:simpleType" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		ИначеЕсли ЧтениеXML.Имя = "xs:simpleType" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.ЗначениеАтрибута("name") = "TypeEnum" Тогда
			НачалоЗаполнения = Истина;
		ИначеЕсли НачалоЗаполнения И ЧтениеXML.Имя = "xs:enumeration" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			НовыйЭлемент = СписокВыбора.Добавить(ЧтениеXML.ЗначениеАтрибута("value"));
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
					НовыйЭлемент.Представление = ЧтениеXML.Значение + "(" + НовыйЭлемент.Значение + ")";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокКодовТиповФСМ_АМ(Элементы.ТипМарки.СписокВыбора);
	ЭтотОбъект.СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНаСервере()
	
	ТипМарки = СокрЛП(ТипМарки);
	//Если Не СтрДлина(ТипМарки) = 3 Тогда
	//	ВывестиСообщение(НСтр("ru = 'Неверно задан Тип марки'"));
	//	Возврат
	//КонецЕсли;
	
	СерияМарки = СокрЛП(СерияМарки);
	Если Не СтрДлина(СерияМарки) = 3 Тогда
		ВывестиСообщение(НСтр("ru = 'Неверно задана Серия марки'"));
		Возврат
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерМарки) Тогда
		ВывестиСообщение(НСтр("ru = 'Не заполнен номер марки'"));
		Возврат
	КонецЕсли;
	
	МассивПоиска = Новый Массив;
	Если ЗначениеЗаполнено(ТипМарки) Тогда
		МассивПоиска.Добавить(ТипМарки);
	Иначе
		МассивПоиска.Добавить("___");
	КонецЕсли;
	МассивПоиска.Добавить(СерияМарки);
	МассивПоиска.Добавить(НомерМарки);
	МассивПоиска.Добавить("%");
	
	СтрокаПоиска = СтрСоединить(МассивПоиска);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОстаткиМарокЕГАИС.КодМарки КАК КодМарки,
	|	ОстаткиМарокЕГАИС.Справка2.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ОстаткиМарокЕГАИС.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ИСТИНА КАК НаПечать
	|ИЗ
	|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(,КодМарки ПОДОБНО &СтрокаПоиска) КАК ОстаткиМарокЕГАИС
	|";
	
	ТаблицаРезультата.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ТипМарки   = Лев(НоваяСтрока.КодМарки, 3);
		НоваяСтрока.СерияМарки = Сред(НоваяСтрока.КодМарки, 4, 3);
		НоваяСтрока.НомерМарки = Сред(НоваяСтрока.КодМарки, 7, 8);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	ВыполнитьПоискНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрКоманды = Новый Массив;
	
	МаркиДляПечати = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
		
		Если Не ТекущаяСтрока.НаПечать Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрКоманды.Количество() = 0 Тогда
			ПараметрКоманды.Добавить(ТекущаяСтрока.ОрганизацияЕГАИС);
		КонецЕсли;
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("КодМарки", ТекущаяСтрока.КодМарки);
		
		МаркиДляПечати.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Настройки = Новый Структура;
	Настройки.Вставить("МаркиДляПечати", МаркиДляПечати);
	
	ПараметрыПечати = Новый Структура("СтруктураНастроек", Настройки);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.МодульОбменаЕГАИС",
		"ПФ_MXL_МаркаБезОписания",
		ПараметрКоманды,
		Неопределено,
		ПараметрыПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСОписанием(Команда)
	
	ПараметрКоманды = Новый Массив;
	
	МаркиДляПечати = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
		
		Если Не ТекущаяСтрока.НаПечать Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрКоманды.Количество() = 0 Тогда
			ПараметрКоманды.Добавить(ТекущаяСтрока.ОрганизацияЕГАИС);
		КонецЕсли;
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("КодМарки", ТекущаяСтрока.КодМарки);
		НоваяСтрока.Вставить("ТипМарки", ТекущаяСтрока.ТипМарки);
		НоваяСтрока.Вставить("СерияМарки", ТекущаяСтрока.СерияМарки);
		НоваяСтрока.Вставить("НомерМарки", ТекущаяСтрока.НомерМарки);
		НоваяСтрока.Вставить("ОрганизацияЕГАИС", ТекущаяСтрока.ОрганизацияЕГАИС);
		
		МаркиДляПечати.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Настройки = Новый Структура;
	Настройки.Вставить("МаркиДляПечати", МаркиДляПечати);
		
	ПараметрыПечати = Новый Структура("СтруктураНастроек",Настройки);	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.МодульОбменаЕГАИС",
		"ПФ_MXL_Марка",
		ПараметрКоманды,
		Неопределено,
		ПараметрыПечати);
	
КонецПроцедуры
